## Subsetting Pandas DataFrame

In [2]:
import pandas as pd

data = {'name': ['Alice', 'Bob', 'Charlie', 'Tim', 'George', 'Frank'],
        'age': [25, 32, 18, 25, 40, 48],
        'height': [170, 175, 180, 168, 165, 180]}

df = pd.DataFrame(data)

In [3]:
df['name']

0      Alice
1        Bob
2    Charlie
3        Tim
4     George
5      Frank
Name: name, dtype: object

In [4]:
df[['name', 'height']]

      name  height
0    Alice     170
1      Bob     175
2  Charlie     180
3      Tim     168
4   George     165
5    Frank     180

In [5]:
df_tall = df['height'] >= 175
df[df_tall]

      name  age  height
1      Bob   32     175
2  Charlie   18     180
5    Frank   48     180

In [6]:
df[df['name'] == 'Bob']

  name  age  height
1  Bob   32     175

In [7]:
df_adults = df['age'] > 18
df[df_tall & df_adults]

    name  age  height
1    Bob   32     175
5  Frank   48     180

In [8]:
df[(df['age'] > 18) & (df['height'] >= 175)]

    name  age  height
1    Bob   32     175
5  Frank   48     180

In [10]:
suspects = ['Frank', 'Charlie', 'Tom']
df_suspects = df['name'].isin(suspects)
df[df_suspects]

      name  age  height
2  Charlie   18     180
5    Frank   48     180